/* automatically generated by rust-bindgen 0.72.1 */

pub const SQLITE_VERSION_NUMBER: ::core::ffi::c_int = 3037000;
pub const SQLITE_SOURCE_ID: &[u8; 85] =
    b"2021-11-27 14:13:22 bd41822c7424d393a30e92ff6cb254d25c26769889c1499a18a0b9339f5d6c8a\0";
pub const SQLITE_OK: ::core::ffi::c_int = 0;
pub const SQLITE_ERROR: ::core::ffi::c_int = 1;
pub const SQLITE_INTERNAL: ::core::ffi::c_int = 2;
pub const SQLITE_PERM: ::core::ffi::c_int = 3;
pub const SQLITE_ABORT: ::core::ffi::c_int = 4;
pub const SQLITE_BUSY: ::core::ffi::c_int = 5;
pub const SQLITE_LOCKED: ::core::ffi::c_int = 6;
pub const SQLITE_NOMEM: ::core::ffi::c_int = 7;
pub const SQLITE_READONLY: ::core::ffi::c_int = 8;
pub const SQLITE_INTERRUPT: ::core::ffi::c_int = 9;
pub const SQLITE_IOERR: ::core::ffi::c_int = 10;
pub const SQLITE_CORRUPT: ::core::ffi::c_int = 11;
pub const SQLITE_NOTFOUND: ::core::ffi::c_int = 12;
pub const SQLITE_FULL: ::core::ffi::c_int = 13;
pub const SQLITE_CANTOPEN: ::core::ffi::c_int = 14;
pub const SQLITE_PROTOCOL: ::core::ffi::c_int = 15;
pub const SQLITE_EMPTY: ::core::ffi::c_int = 16;
pub const SQLITE_SCHEMA: ::core::ffi::c_int = 17;
pub const SQLITE_TOOBIG: ::core::ffi::c_int = 18;
pub const SQLITE_CONSTRAINT: ::core::ffi::c_int = 19;
pub const SQLITE_MISMATCH: ::core::ffi::c_int = 20;
pub const SQLITE_MISUSE: ::core::ffi::c_int = 21;
pub const SQLITE_NOLFS: ::core::ffi::c_int = 22;
pub const SQLITE_AUTH: ::core::ffi::c_int = 23;
pub const SQLITE_FORMAT: ::core::ffi::c_int = 24;

pub const SQLITE_SCANSTAT_NAME: ::core::ffi::c_int = 3;
pub const SQLITE_SCANSTAT_EXPLAIN: ::core::ffi::c_int = 4;
pub const SQLITE_SCANSTAT_SELECTID: ::core::ffi::c_int = 5;
pub const SQLITE_SERIALIZE_NOCOPY: ::core::ffi::c_int = 1;
pub const SQLITE_DESERIALIZE_FREEONCLOSE: ::core::ffi::c_int = 1;
pub const SQLITE_DESERIALIZE_RESIZEABLE: ::core::ffi::c_int = 2;
pub const SQLITE_DESERIALIZE_READONLY: ::core::ffi::c_int = 4;
pub const NOT_WITHIN: ::core::ffi::c_int = 0;
pub const PARTLY_WITHIN: ::core::ffi::c_int = 1;
pub const FULLY_WITHIN: ::core::ffi::c_int = 2;
pub const FTS5_TOKENIZE_QUERY: ::core::ffi::c_int = 1;
pub const FTS5_TOKENIZE_PREFIX: ::core::ffi::c_int = 2;
pub const FTS5_TOKENIZE_DOCUMENT: ::core::ffi::c_int = 4;
pub const FTS5_TOKENIZE_AUX: ::core::ffi::c_int = 8;
pub const FTS5_TOKEN_COLOCATED: ::core::ffi::c_int = 1;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
unsafe extern "C" {
    pub static sqlite3_version: [::core::ffi::c_char; 0usize];
}
unsafe extern "C" {
    pub fn sqlite3_libversion() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_sourceid() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_libversion_number() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_compileoption_used(zOptName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_compileoption_get(N: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_threadsafe() -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3 {
    _unused: [u8; 0],
}
pub type sqlite_int64 = ::core::ffi::c_longlong;
pub type sqlite_uint64 = ::core::ffi::c_ulonglong;
pub type sqlite3_int64 = sqlite_int64;
pub type sqlite3_uint64 = sqlite_uint64;
unsafe extern "C" {
    pub fn sqlite3_close(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_close_v2(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
pub type sqlite3_callback = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: *mut *mut ::core::ffi::c_char,
        arg4: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    pub fn sqlite3_exec(
        arg1: *mut sqlite3,
        sql: *const ::core::ffi::c_char,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut ::core::ffi::c_char,
                arg4: *mut *mut ::core::ffi::c_char,
            ) -> ::core::ffi::c_int,
        >,
        arg2: *mut ::core::ffi::c_void,
        errmsg: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_file {
    pub pMethods: *const sqlite3_io_methods,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_file"][::core::mem::size_of::<sqlite3_file>() - 8usize];
    ["Alignment of sqlite3_file"][::core::mem::align_of::<sqlite3_file>() - 8usize];
    ["Offset of field: sqlite3_file::pMethods"]
        [::core::mem::offset_of!(sqlite3_file, pMethods) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_io_methods {
    pub iVersion: ::core::ffi::c_int,
    pub xClose:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file) -> ::core::ffi::c_int>,
    pub xRead: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: *mut ::core::ffi::c_void,
            iAmt: ::core::ffi::c_int,
            iOfst: sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xWrite: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: *const ::core::ffi::c_void,
            iAmt: ::core::ffi::c_int,
            iOfst: sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xTruncate: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_file, size: sqlite3_int64) -> ::core::ffi::c_int,
    >,
    pub xSync: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            flags: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFileSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            pSize: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xLock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xUnlock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xCheckReservedLock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            pResOut: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFileControl: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            op: ::core::ffi::c_int,
            pArg: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xSectorSize:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file) -> ::core::ffi::c_int>,
    pub xDeviceCharacteristics:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file) -> ::core::ffi::c_int>,
    pub xShmMap: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            iPg: ::core::ffi::c_int,
            pgsz: ::core::ffi::c_int,
            arg2: ::core::ffi::c_int,
            arg3: *mut *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xShmLock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            offset: ::core::ffi::c_int,
            n: ::core::ffi::c_int,
            flags: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xShmBarrier: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file)>,
    pub xShmUnmap: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            deleteFlag: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            iOfst: sqlite3_int64,
            iAmt: ::core::ffi::c_int,
            pp: *mut *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xUnfetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            iOfst: sqlite3_int64,
            p: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_io_methods"][::core::mem::size_of::<sqlite3_io_methods>() - 152usize];
    ["Alignment of sqlite3_io_methods"][::core::mem::align_of::<sqlite3_io_methods>() - 8usize];
    ["Offset of field: sqlite3_io_methods::iVersion"]
        [::core::mem::offset_of!(sqlite3_io_methods, iVersion) - 0usize];
    ["Offset of field: sqlite3_io_methods::xClose"]
        [::core::mem::offset_of!(sqlite3_io_methods, xClose) - 8usize];
    ["Offset of field: sqlite3_io_methods::xRead"]
        [::core::mem::offset_of!(sqlite3_io_methods, xRead) - 16usize];
    ["Offset of field: sqlite3_io_methods::xWrite"]
        [::core::mem::offset_of!(sqlite3_io_methods, xWrite) - 24usize];
    ["Offset of field: sqlite3_io_methods::xTruncate"]
        [::core::mem::offset_of!(sqlite3_io_methods, xTruncate) - 32usize];
    ["Offset of field: sqlite3_io_methods::xSync"]
        [::core::mem::offset_of!(sqlite3_io_methods, xSync) - 40usize];
    ["Offset of field: sqlite3_io_methods::xFileSize"]
        [::core::mem::offset_of!(sqlite3_io_methods, xFileSize) - 48usize];
    ["Offset of field: sqlite3_io_methods::xLock"]
        [::core::mem::offset_of!(sqlite3_io_methods, xLock) - 56usize];
    ["Offset of field: sqlite3_io_methods::xUnlock"]
        [::core::mem::offset_of!(sqlite3_io_methods, xUnlock) - 64usize];
    ["Offset of field: sqlite3_io_methods::xCheckReservedLock"]
        [::core::mem::offset_of!(sqlite3_io_methods, xCheckReservedLock) - 72usize];
    ["Offset of field: sqlite3_io_methods::xFileControl"]
        [::core::mem::offset_of!(sqlite3_io_methods, xFileControl) - 80usize];
    ["Offset of field: sqlite3_io_methods::xSectorSize"]
        [::core::mem::offset_of!(sqlite3_io_methods, xSectorSize) - 88usize];
    ["Offset of field: sqlite3_io_methods::xDeviceCharacteristics"]
        [::core::mem::offset_of!(sqlite3_io_methods, xDeviceCharacteristics) - 96usize];
    ["Offset of field: sqlite3_io_methods::xShmMap"]
        [::core::mem::offset_of!(sqlite3_io_methods, xShmMap) - 104usize];
    ["Offset of field: sqlite3_io_methods::xShmLock"]
        [::core::mem::offset_of!(sqlite3_io_methods, xShmLock) - 112usize];
    ["Offset of field: sqlite3_io_methods::xShmBarrier"]
        [::core::mem::offset_of!(sqlite3_io_methods, xShmBarrier) - 120usize];
    ["Offset of field: sqlite3_io_methods::xShmUnmap"]
        [::core::mem::offset_of!(sqlite3_io_methods, xShmUnmap) - 128usize];
    ["Offset of field: sqlite3_io_methods::xFetch"]
        [::core::mem::offset_of!(sqlite3_io_methods, xFetch) - 136usize];
    ["Offset of field: sqlite3_io_methods::xUnfetch"]
        [::core::mem::offset_of!(sqlite3_io_methods, xUnfetch) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_mutex {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_api_routines {
    _unused: [u8; 0],
}
pub type sqlite3_syscall_ptr = ::core::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_vfs {
    pub iVersion: ::core::ffi::c_int,
    pub szOsFile: ::core::ffi::c_int,
    pub mxPathname: ::core::ffi::c_int,
    pub pNext: *mut sqlite3_vfs,
    pub zName: *const ::core::ffi::c_char,
    pub pAppData: *mut ::core::ffi::c_void,
    pub xOpen: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            arg2: *mut sqlite3_file,
            flags: ::core::ffi::c_int,
            pOutFlags: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xDelete: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            syncDir: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xAccess: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            flags: ::core::ffi::c_int,
            pResOut: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFullPathname: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            nOut: ::core::ffi::c_int,
            zOut: *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xDlOpen: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zFilename: *const ::core::ffi::c_char,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xDlError: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            nByte: ::core::ffi::c_int,
            zErrMsg: *mut ::core::ffi::c_char,
        ),
    >,
    pub xDlSym: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: *mut ::core::ffi::c_void,
            zSymbol: *const ::core::ffi::c_char,
        ) -> ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_vfs,
                arg2: *mut ::core::ffi::c_void,
                zSymbol: *const ::core::ffi::c_char,
            ),
        >,
    >,
    pub xDlClose: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vfs, arg2: *mut ::core::ffi::c_void),
    >,
    pub xRandomness: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            nByte: ::core::ffi::c_int,
            zOut: *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xSleep: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            microseconds: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xCurrentTime: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vfs, arg2: *mut f64) -> ::core::ffi::c_int,
    >,
    pub xGetLastError: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: ::core::ffi::c_int,
            arg3: *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xCurrentTimeInt64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xSetSystemCall: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            arg2: sqlite3_syscall_ptr,
        ) -> ::core::ffi::c_int,
    >,
    pub xGetSystemCall: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
        ) -> sqlite3_syscall_ptr,
    >,
    pub xNextSystemCall: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
        ) -> *const ::core::ffi::c_char,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_vfs"][::core::mem::size_of::<sqlite3_vfs>() - 168usize];
    ["Alignment of sqlite3_vfs"][::core::mem::align_of::<sqlite3_vfs>() - 8usize];
    ["Offset of field: sqlite3_vfs::iVersion"]
        [::core::mem::offset_of!(sqlite3_vfs, iVersion) - 0usize];
    ["Offset of field: sqlite3_vfs::szOsFile"]
        [::core::mem::offset_of!(sqlite3_vfs, szOsFile) - 4usize];
    ["Offset of field: sqlite3_vfs::mxPathname"]
        [::core::mem::offset_of!(sqlite3_vfs, mxPathname) - 8usize];
    ["Offset of field: sqlite3_vfs::pNext"][::core::mem::offset_of!(sqlite3_vfs, pNext) - 16usize];
    ["Offset of field: sqlite3_vfs::zName"][::core::mem::offset_of!(sqlite3_vfs, zName) - 24usize];
    ["Offset of field: sqlite3_vfs::pAppData"]
        [::core::mem::offset_of!(sqlite3_vfs, pAppData) - 32usize];
    ["Offset of field: sqlite3_vfs::xOpen"][::core::mem::offset_of!(sqlite3_vfs, xOpen) - 40usize];
    ["Offset of field: sqlite3_vfs::xDelete"]
        [::core::mem::offset_of!(sqlite3_vfs, xDelete) - 48usize];
    ["Offset of field: sqlite3_vfs::xAccess"]
        [::core::mem::offset_of!(sqlite3_vfs, xAccess) - 56usize];
    ["Offset of field: sqlite3_vfs::xFullPathname"]
        [::core::mem::offset_of!(sqlite3_vfs, xFullPathname) - 64usize];
    ["Offset of field: sqlite3_vfs::xDlOpen"]
        [::core::mem::offset_of!(sqlite3_vfs, xDlOpen) - 72usize];
    ["Offset of field: sqlite3_vfs::xDlError"]
        [::core::mem::offset_of!(sqlite3_vfs, xDlError) - 80usize];
    ["Offset of field: sqlite3_vfs::xDlSym"]
        [::core::mem::offset_of!(sqlite3_vfs, xDlSym) - 88usize];
    ["Offset of field: sqlite3_vfs::xDlClose"]
        [::core::mem::offset_of!(sqlite3_vfs, xDlClose) - 96usize];
    ["Offset of field: sqlite3_vfs::xRandomness"]
        [::core::mem::offset_of!(sqlite3_vfs, xRandomness) - 104usize];
    ["Offset of field: sqlite3_vfs::xSleep"]
        [::core::mem::offset_of!(sqlite3_vfs, xSleep) - 112usize];
    ["Offset of field: sqlite3_vfs::xCurrentTime"]
        [::core::mem::offset_of!(sqlite3_vfs, xCurrentTime) - 120usize];
    ["Offset of field: sqlite3_vfs::xGetLastError"]
        [::core::mem::offset_of!(sqlite3_vfs, xGetLastError) - 128usize];
    ["Offset of field: sqlite3_vfs::xCurrentTimeInt64"]
        [::core::mem::offset_of!(sqlite3_vfs, xCurrentTimeInt64) - 136usize];
    ["Offset of field: sqlite3_vfs::xSetSystemCall"]
        [::core::mem::offset_of!(sqlite3_vfs, xSetSystemCall) - 144usize];
    ["Offset of field: sqlite3_vfs::xGetSystemCall"]
        [::core::mem::offset_of!(sqlite3_vfs, xGetSystemCall) - 152usize];
    ["Offset of field: sqlite3_vfs::xNextSystemCall"]
        [::core::mem::offset_of!(sqlite3_vfs, xNextSystemCall) - 160usize];
};
unsafe extern "C" {
    pub fn sqlite3_initialize() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_shutdown() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_os_init() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_os_end() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_config(arg1: ::core::ffi::c_int, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_db_config(arg1: *mut sqlite3, op: ::core::ffi::c_int, ...)
    -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_mem_methods {
    pub xMalloc: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_void,
    >,
    pub xFree: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub xRealloc: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xSize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xRoundup: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub xInit: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xShutdown: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub pAppData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_mem_methods"][::core::mem::size_of::<sqlite3_mem_methods>() - 64usize];
    ["Alignment of sqlite3_mem_methods"][::core::mem::align_of::<sqlite3_mem_methods>() - 8usize];
    ["Offset of field: sqlite3_mem_methods::xMalloc"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xMalloc) - 0usize];
    ["Offset of field: sqlite3_mem_methods::xFree"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xFree) - 8usize];
    ["Offset of field: sqlite3_mem_methods::xRealloc"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xRealloc) - 16usize];
    ["Offset of field: sqlite3_mem_methods::xSize"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xSize) - 24usize];
    ["Offset of field: sqlite3_mem_methods::xRoundup"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xRoundup) - 32usize];
    ["Offset of field: sqlite3_mem_methods::xInit"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xInit) - 40usize];
    ["Offset of field: sqlite3_mem_methods::xShutdown"]
        [::core::mem::offset_of!(sqlite3_mem_methods, xShutdown) - 48usize];
    ["Offset of field: sqlite3_mem_methods::pAppData"]
        [::core::mem::offset_of!(sqlite3_mem_methods, pAppData) - 56usize];
};
unsafe extern "C" {
    pub fn sqlite3_extended_result_codes(
        arg1: *mut sqlite3,
        onoff: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_last_insert_rowid(arg1: *mut sqlite3) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_set_last_insert_rowid(arg1: *mut sqlite3, arg2: sqlite3_int64);
}
unsafe extern "C" {
    pub fn sqlite3_changes(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_changes64(arg1: *mut sqlite3) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_total_changes(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_total_changes64(arg1: *mut sqlite3) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_interrupt(arg1: *mut sqlite3);
}
unsafe extern "C" {
    pub fn sqlite3_complete(sql: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_complete16(sql: *const ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_busy_handler(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_busy_timeout(arg1: *mut sqlite3, ms: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_get_table(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        pazResult: *mut *mut *mut ::core::ffi::c_char,
        pnRow: *mut ::core::ffi::c_int,
        pnColumn: *mut ::core::ffi::c_int,
        pzErrmsg: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_free_table(result: *mut *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn sqlite3_mprintf(arg1: *const ::core::ffi::c_char, ...) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_vmprintf(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut __va_list_tag,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_snprintf(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_vsnprintf(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: *mut __va_list_tag,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_malloc(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_malloc64(arg1: sqlite3_uint64) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_realloc(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_realloc64(
        arg1: *mut ::core::ffi::c_void,
        arg2: sqlite3_uint64,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_free(arg1: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn sqlite3_msize(arg1: *mut ::core::ffi::c_void) -> sqlite3_uint64;
}
unsafe extern "C" {
    pub fn sqlite3_memory_used() -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_memory_highwater(resetFlag: ::core::ffi::c_int) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_randomness(N: ::core::ffi::c_int, P: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn sqlite3_set_authorizer(
        arg1: *mut sqlite3,
        xAuth: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_char,
                arg4: *const ::core::ffi::c_char,
                arg5: *const ::core::ffi::c_char,
                arg6: *const ::core::ffi::c_char,
            ) -> ::core::ffi::c_int,
        >,
        pUserData: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_trace(
        arg1: *mut sqlite3,
        xTrace: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void, arg2: *const ::core::ffi::c_char),
        >,
        arg2: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_profile(
        arg1: *mut sqlite3,
        xProfile: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_char,
                arg3: sqlite3_uint64,
            ),
        >,
        arg2: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_trace_v2(
        arg1: *mut sqlite3,
        uMask: ::core::ffi::c_uint,
        xCallback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: ::core::ffi::c_uint,
                arg2: *mut ::core::ffi::c_void,
                arg3: *mut ::core::ffi::c_void,
                arg4: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        pCtx: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_progress_handler(
        arg1: *mut sqlite3,
        arg2: ::core::ffi::c_int,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
        arg4: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    pub fn sqlite3_open(
        filename: *const ::core::ffi::c_char,
        ppDb: *mut *mut sqlite3,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_open16(
        filename: *const ::core::ffi::c_void,
        ppDb: *mut *mut sqlite3,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_open_v2(
        filename: *const ::core::ffi::c_char,
        ppDb: *mut *mut sqlite3,
        flags: ::core::ffi::c_int,
        zVfs: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_uri_parameter(
        zFilename: *const ::core::ffi::c_char,
        zParam: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_uri_boolean(
        zFile: *const ::core::ffi::c_char,
        zParam: *const ::core::ffi::c_char,
        bDefault: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_uri_int64(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: sqlite3_int64,
    ) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_uri_key(
        zFilename: *const ::core::ffi::c_char,
        N: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_filename_database(
        arg1: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_filename_journal(arg1: *const ::core::ffi::c_char)
    -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_filename_wal(arg1: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_database_file_object(arg1: *const ::core::ffi::c_char) -> *mut sqlite3_file;
}
unsafe extern "C" {
    pub fn sqlite3_create_filename(
        zDatabase: *const ::core::ffi::c_char,
        zJournal: *const ::core::ffi::c_char,
        zWal: *const ::core::ffi::c_char,
        nParam: ::core::ffi::c_int,
        azParam: *mut *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_free_filename(arg1: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn sqlite3_errcode(db: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_extended_errcode(db: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_errmsg(arg1: *mut sqlite3) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_errmsg16(arg1: *mut sqlite3) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_errstr(arg1: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_stmt {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn sqlite3_limit(
        arg1: *mut sqlite3,
        id: ::core::ffi::c_int,
        newVal: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_prepare(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_prepare_v2(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_prepare_v3(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        nByte: ::core::ffi::c_int,
        prepFlags: ::core::ffi::c_uint,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_prepare16(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_void,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_prepare16_v2(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_void,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_prepare16_v3(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_void,
        nByte: ::core::ffi::c_int,
        prepFlags: ::core::ffi::c_uint,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_sql(pStmt: *mut sqlite3_stmt) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_expanded_sql(pStmt: *mut sqlite3_stmt) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_stmt_readonly(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_stmt_isexplain(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_stmt_busy(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_value {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_context {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn sqlite3_bind_blob(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_void,
        n: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_blob64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_void,
        arg4: sqlite3_uint64,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_double(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_int(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_int64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: sqlite3_int64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_null(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_text(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: ::core::ffi::c_int,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_text16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_void,
        arg4: ::core::ffi::c_int,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_text64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: sqlite3_uint64,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        encoding: ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_value(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const sqlite3_value,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_pointer(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *mut ::core::ffi::c_void,
        arg4: *const ::core::ffi::c_char,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_zeroblob(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        n: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_zeroblob64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: sqlite3_uint64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_parameter_count(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_bind_parameter_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_bind_parameter_index(
        arg1: *mut sqlite3_stmt,
        zName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_clear_bindings(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_column_count(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_column_name(
        arg1: *mut sqlite3_stmt,
        N: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_column_name16(
        arg1: *mut sqlite3_stmt,
        N: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_column_database_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_column_database_name16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_column_table_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_column_table_name16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_column_origin_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_column_origin_name16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_column_decltype(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_column_decltype16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_step(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_data_count(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_column_blob(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_column_double(arg1: *mut sqlite3_stmt, iCol: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn sqlite3_column_int(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_column_int64(arg1: *mut sqlite3_stmt, iCol: ::core::ffi::c_int)
    -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_column_text(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn sqlite3_column_text16(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_column_value(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *mut sqlite3_value;
}
unsafe extern "C" {
    pub fn sqlite3_column_bytes(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_column_bytes16(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_column_type(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_finalize(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_reset(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_function(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xFunc: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_function16(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_void,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xFunc: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_function_v2(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xFunc: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_window_function(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        xValue: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        xInverse: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_aggregate_count(arg1: *mut sqlite3_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_expired(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_transfer_bindings(
        arg1: *mut sqlite3_stmt,
        arg2: *mut sqlite3_stmt,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_global_recover() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_thread_cleanup();
}
unsafe extern "C" {
    pub fn sqlite3_memory_alarm(
        arg1: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: sqlite3_int64,
                arg3: ::core::ffi::c_int,
            ),
        >,
        arg2: *mut ::core::ffi::c_void,
        arg3: sqlite3_int64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_blob(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_value_double(arg1: *mut sqlite3_value) -> f64;
}
unsafe extern "C" {
    pub fn sqlite3_value_int(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_int64(arg1: *mut sqlite3_value) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_value_pointer(
        arg1: *mut sqlite3_value,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_value_text(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn sqlite3_value_text16(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_value_text16le(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_value_text16be(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_value_bytes(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_bytes16(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_type(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_numeric_type(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_nochange(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_frombind(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_value_subtype(arg1: *mut sqlite3_value) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn sqlite3_value_dup(arg1: *const sqlite3_value) -> *mut sqlite3_value;
}
unsafe extern "C" {
    pub fn sqlite3_value_free(arg1: *mut sqlite3_value);
}
unsafe extern "C" {
    pub fn sqlite3_aggregate_context(
        arg1: *mut sqlite3_context,
        nBytes: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_user_data(arg1: *mut sqlite3_context) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_context_db_handle(arg1: *mut sqlite3_context) -> *mut sqlite3;
}
unsafe extern "C" {
    pub fn sqlite3_get_auxdata(
        arg1: *mut sqlite3_context,
        N: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_set_auxdata(
        arg1: *mut sqlite3_context,
        N: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
pub type sqlite3_destructor_type =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>;
unsafe extern "C" {
    pub fn sqlite3_result_blob(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_blob64(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: sqlite3_uint64,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_double(arg1: *mut sqlite3_context, arg2: f64);
}
unsafe extern "C" {
    pub fn sqlite3_result_error(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_error16(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_error_toobig(arg1: *mut sqlite3_context);
}
unsafe extern "C" {
    pub fn sqlite3_result_error_nomem(arg1: *mut sqlite3_context);
}
unsafe extern "C" {
    pub fn sqlite3_result_error_code(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn sqlite3_result_int(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn sqlite3_result_int64(arg1: *mut sqlite3_context, arg2: sqlite3_int64);
}
unsafe extern "C" {
    pub fn sqlite3_result_null(arg1: *mut sqlite3_context);
}
unsafe extern "C" {
    pub fn sqlite3_result_text(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_text64(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_char,
        arg3: sqlite3_uint64,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        encoding: ::core::ffi::c_uchar,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_text16(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_text16le(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_text16be(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_value(arg1: *mut sqlite3_context, arg2: *mut sqlite3_value);
}
unsafe extern "C" {
    pub fn sqlite3_result_pointer(
        arg1: *mut sqlite3_context,
        arg2: *mut ::core::ffi::c_void,
        arg3: *const ::core::ffi::c_char,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
unsafe extern "C" {
    pub fn sqlite3_result_zeroblob(arg1: *mut sqlite3_context, n: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn sqlite3_result_zeroblob64(
        arg1: *mut sqlite3_context,
        n: sqlite3_uint64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_result_subtype(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn sqlite3_create_collation(
        arg1: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        eTextRep: ::core::ffi::c_int,
        pArg: *mut ::core::ffi::c_void,
        xCompare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
                arg4: ::core::ffi::c_int,
                arg5: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_collation_v2(
        arg1: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        eTextRep: ::core::ffi::c_int,
        pArg: *mut ::core::ffi::c_void,
        xCompare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
                arg4: ::core::ffi::c_int,
                arg5: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_collation16(
        arg1: *mut sqlite3,
        zName: *const ::core::ffi::c_void,
        eTextRep: ::core::ffi::c_int,
        pArg: *mut ::core::ffi::c_void,
        xCompare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
                arg4: ::core::ffi::c_int,
                arg5: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_collation_needed(
        arg1: *mut sqlite3,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut sqlite3,
                eTextRep: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_char,
            ),
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_collation_needed16(
        arg1: *mut sqlite3,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut sqlite3,
                eTextRep: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
            ),
        >,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_sleep(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut sqlite3_temp_directory: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub static mut sqlite3_data_directory: *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_win32_set_directory(
        type_: ::core::ffi::c_ulong,
        zValue: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_win32_set_directory8(
        type_: ::core::ffi::c_ulong,
        zValue: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_win32_set_directory16(
        type_: ::core::ffi::c_ulong,
        zValue: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_get_autocommit(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_db_handle(arg1: *mut sqlite3_stmt) -> *mut sqlite3;
}
unsafe extern "C" {
    pub fn sqlite3_db_filename(
        db: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_db_readonly(
        db: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_txn_state(
        arg1: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_next_stmt(pDb: *mut sqlite3, pStmt: *mut sqlite3_stmt) -> *mut sqlite3_stmt;
}
unsafe extern "C" {
    pub fn sqlite3_commit_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_rollback_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_autovacuum_pages(
        db: *mut sqlite3,
        arg1: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_char,
                arg3: ::core::ffi::c_uint,
                arg4: ::core::ffi::c_uint,
                arg5: ::core::ffi::c_uint,
            ) -> ::core::ffi::c_uint,
        >,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_update_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_char,
                arg4: *const ::core::ffi::c_char,
                arg5: sqlite3_int64,
            ),
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_enable_shared_cache(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_release_memory(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_db_release_memory(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_soft_heap_limit64(N: sqlite3_int64) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_hard_heap_limit64(N: sqlite3_int64) -> sqlite3_int64;
}
unsafe extern "C" {
    pub fn sqlite3_soft_heap_limit(N: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn sqlite3_table_column_metadata(
        db: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
        zTableName: *const ::core::ffi::c_char,
        zColumnName: *const ::core::ffi::c_char,
        pzDataType: *mut *const ::core::ffi::c_char,
        pzCollSeq: *mut *const ::core::ffi::c_char,
        pNotNull: *mut ::core::ffi::c_int,
        pPrimaryKey: *mut ::core::ffi::c_int,
        pAutoinc: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_load_extension(
        db: *mut sqlite3,
        zFile: *const ::core::ffi::c_char,
        zProc: *const ::core::ffi::c_char,
        pzErrMsg: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_enable_load_extension(
        db: *mut sqlite3,
        onoff: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_auto_extension(
        xEntryPoint: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_cancel_auto_extension(
        xEntryPoint: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_reset_auto_extension();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_module {
    pub iVersion: ::core::ffi::c_int,
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            pAux: *mut ::core::ffi::c_void,
            argc: ::core::ffi::c_int,
            argv: *const *const ::core::ffi::c_char,
            ppVTab: *mut *mut sqlite3_vtab,
            arg2: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xConnect: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            pAux: *mut ::core::ffi::c_void,
            argc: ::core::ffi::c_int,
            argv: *const *const ::core::ffi::c_char,
            ppVTab: *mut *mut sqlite3_vtab,
            arg2: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xBestIndex: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: *mut sqlite3_index_info,
        ) -> ::core::ffi::c_int,
    >,
    pub xDisconnect: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xDestroy: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xOpen: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            ppCursor: *mut *mut sqlite3_vtab_cursor,
        ) -> ::core::ffi::c_int,
    >,
    pub xClose: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vtab_cursor) -> ::core::ffi::c_int,
    >,
    pub xFilter: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab_cursor,
            idxNum: ::core::ffi::c_int,
            idxStr: *const ::core::ffi::c_char,
            argc: ::core::ffi::c_int,
            argv: *mut *mut sqlite3_value,
        ) -> ::core::ffi::c_int,
    >,
    pub xNext: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vtab_cursor) -> ::core::ffi::c_int,
    >,
    pub xEof: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vtab_cursor) -> ::core::ffi::c_int,
    >,
    pub xColumn: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab_cursor,
            arg2: *mut sqlite3_context,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRowid: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab_cursor,
            pRowid: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xUpdate: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab,
            arg2: ::core::ffi::c_int,
            arg3: *mut *mut sqlite3_value,
            arg4: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xBegin: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xSync: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xCommit: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xRollback: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xFindFunction: ::core::option::Option<
        unsafe extern "C" fn(
            pVtab: *mut sqlite3_vtab,
            nArg: ::core::ffi::c_int,
            zName: *const ::core::ffi::c_char,
            pxFunc: *mut ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            ppArg: *mut *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xRename: ::core::option::Option<
        unsafe extern "C" fn(
            pVtab: *mut sqlite3_vtab,
            zNew: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xSavepoint: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRelease: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRollbackTo: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xShadowName: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_module"][::core::mem::size_of::<sqlite3_module>() - 192usize];
    ["Alignment of sqlite3_module"][::core::mem::align_of::<sqlite3_module>() - 8usize];
    ["Offset of field: sqlite3_module::iVersion"]
        [::core::mem::offset_of!(sqlite3_module, iVersion) - 0usize];
    ["Offset of field: sqlite3_module::xCreate"]
        [::core::mem::offset_of!(sqlite3_module, xCreate) - 8usize];
    ["Offset of field: sqlite3_module::xConnect"]
        [::core::mem::offset_of!(sqlite3_module, xConnect) - 16usize];
    ["Offset of field: sqlite3_module::xBestIndex"]
        [::core::mem::offset_of!(sqlite3_module, xBestIndex) - 24usize];
    ["Offset of field: sqlite3_module::xDisconnect"]
        [::core::mem::offset_of!(sqlite3_module, xDisconnect) - 32usize];
    ["Offset of field: sqlite3_module::xDestroy"]
        [::core::mem::offset_of!(sqlite3_module, xDestroy) - 40usize];
    ["Offset of field: sqlite3_module::xOpen"]
        [::core::mem::offset_of!(sqlite3_module, xOpen) - 48usize];
    ["Offset of field: sqlite3_module::xClose"]
        [::core::mem::offset_of!(sqlite3_module, xClose) - 56usize];
    ["Offset of field: sqlite3_module::xFilter"]
        [::core::mem::offset_of!(sqlite3_module, xFilter) - 64usize];
    ["Offset of field: sqlite3_module::xNext"]
        [::core::mem::offset_of!(sqlite3_module, xNext) - 72usize];
    ["Offset of field: sqlite3_module::xEof"]
        [::core::mem::offset_of!(sqlite3_module, xEof) - 80usize];
    ["Offset of field: sqlite3_module::xColumn"]
        [::core::mem::offset_of!(sqlite3_module, xColumn) - 88usize];
    ["Offset of field: sqlite3_module::xRowid"]
        [::core::mem::offset_of!(sqlite3_module, xRowid) - 96usize];
    ["Offset of field: sqlite3_module::xUpdate"]
        [::core::mem::offset_of!(sqlite3_module, xUpdate) - 104usize];
    ["Offset of field: sqlite3_module::xBegin"]
        [::core::mem::offset_of!(sqlite3_module, xBegin) - 112usize];
    ["Offset of field: sqlite3_module::xSync"]
        [::core::mem::offset_of!(sqlite3_module, xSync) - 120usize];
    ["Offset of field: sqlite3_module::xCommit"]
        [::core::mem::offset_of!(sqlite3_module, xCommit) - 128usize];
    ["Offset of field: sqlite3_module::xRollback"]
        [::core::mem::offset_of!(sqlite3_module, xRollback) - 136usize];
    ["Offset of field: sqlite3_module::xFindFunction"]
        [::core::mem::offset_of!(sqlite3_module, xFindFunction) - 144usize];
    ["Offset of field: sqlite3_module::xRename"]
        [::core::mem::offset_of!(sqlite3_module, xRename) - 152usize];
    ["Offset of field: sqlite3_module::xSavepoint"]
        [::core::mem::offset_of!(sqlite3_module, xSavepoint) - 160usize];
    ["Offset of field: sqlite3_module::xRelease"]
        [::core::mem::offset_of!(sqlite3_module, xRelease) - 168usize];
    ["Offset of field: sqlite3_module::xRollbackTo"]
        [::core::mem::offset_of!(sqlite3_module, xRollbackTo) - 176usize];
    ["Offset of field: sqlite3_module::xShadowName"]
        [::core::mem::offset_of!(sqlite3_module, xShadowName) - 184usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info {
    pub nConstraint: ::core::ffi::c_int,
    pub aConstraint: *mut sqlite3_index_info_sqlite3_index_constraint,
    pub nOrderBy: ::core::ffi::c_int,
    pub aOrderBy: *mut sqlite3_index_info_sqlite3_index_orderby,
    pub aConstraintUsage: *mut sqlite3_index_info_sqlite3_index_constraint_usage,
    pub idxNum: ::core::ffi::c_int,
    pub idxStr: *mut ::core::ffi::c_char,
    pub needToFreeIdxStr: ::core::ffi::c_int,
    pub orderByConsumed: ::core::ffi::c_int,
    pub estimatedCost: f64,
    pub estimatedRows: sqlite3_int64,
    pub idxFlags: ::core::ffi::c_int,
    pub colUsed: sqlite3_uint64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info_sqlite3_index_constraint {
    pub iColumn: ::core::ffi::c_int,
    pub op: ::core::ffi::c_uchar,
    pub usable: ::core::ffi::c_uchar,
    pub iTermOffset: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_index_info_sqlite3_index_constraint"]
        [::core::mem::size_of::<sqlite3_index_info_sqlite3_index_constraint>() - 12usize];
    ["Alignment of sqlite3_index_info_sqlite3_index_constraint"]
        [::core::mem::align_of::<sqlite3_index_info_sqlite3_index_constraint>() - 4usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_constraint::iColumn"]
        [::core::mem::offset_of!(sqlite3_index_info_sqlite3_index_constraint, iColumn) - 0usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_constraint::op"]
        [::core::mem::offset_of!(sqlite3_index_info_sqlite3_index_constraint, op) - 4usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_constraint::usable"]
        [::core::mem::offset_of!(sqlite3_index_info_sqlite3_index_constraint, usable) - 5usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_constraint::iTermOffset"][::core::mem::offset_of!(
        sqlite3_index_info_sqlite3_index_constraint,
        iTermOffset
    ) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info_sqlite3_index_orderby {
    pub iColumn: ::core::ffi::c_int,
    pub desc: ::core::ffi::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_index_info_sqlite3_index_orderby"]
        [::core::mem::size_of::<sqlite3_index_info_sqlite3_index_orderby>() - 8usize];
    ["Alignment of sqlite3_index_info_sqlite3_index_orderby"]
        [::core::mem::align_of::<sqlite3_index_info_sqlite3_index_orderby>() - 4usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_orderby::iColumn"]
        [::core::mem::offset_of!(sqlite3_index_info_sqlite3_index_orderby, iColumn) - 0usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_orderby::desc"]
        [::core::mem::offset_of!(sqlite3_index_info_sqlite3_index_orderby, desc) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info_sqlite3_index_constraint_usage {
    pub argvIndex: ::core::ffi::c_int,
    pub omit: ::core::ffi::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_index_info_sqlite3_index_constraint_usage"]
        [::core::mem::size_of::<sqlite3_index_info_sqlite3_index_constraint_usage>() - 8usize];
    ["Alignment of sqlite3_index_info_sqlite3_index_constraint_usage"]
        [::core::mem::align_of::<sqlite3_index_info_sqlite3_index_constraint_usage>() - 4usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_constraint_usage::argvIndex"][::core::mem::offset_of!(
        sqlite3_index_info_sqlite3_index_constraint_usage,
        argvIndex
    ) - 0usize];
    ["Offset of field: sqlite3_index_info_sqlite3_index_constraint_usage::omit"]
        [::core::mem::offset_of!(sqlite3_index_info_sqlite3_index_constraint_usage, omit) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_index_info"][::core::mem::size_of::<sqlite3_index_info>() - 96usize];
    ["Alignment of sqlite3_index_info"][::core::mem::align_of::<sqlite3_index_info>() - 8usize];
    ["Offset of field: sqlite3_index_info::nConstraint"]
        [::core::mem::offset_of!(sqlite3_index_info, nConstraint) - 0usize];
    ["Offset of field: sqlite3_index_info::aConstraint"]
        [::core::mem::offset_of!(sqlite3_index_info, aConstraint) - 8usize];
    ["Offset of field: sqlite3_index_info::nOrderBy"]
        [::core::mem::offset_of!(sqlite3_index_info, nOrderBy) - 16usize];
    ["Offset of field: sqlite3_index_info::aOrderBy"]
        [::core::mem::offset_of!(sqlite3_index_info, aOrderBy) - 24usize];
    ["Offset of field: sqlite3_index_info::aConstraintUsage"]
        [::core::mem::offset_of!(sqlite3_index_info, aConstraintUsage) - 32usize];
    ["Offset of field: sqlite3_index_info::idxNum"]
        [::core::mem::offset_of!(sqlite3_index_info, idxNum) - 40usize];
    ["Offset of field: sqlite3_index_info::idxStr"]
        [::core::mem::offset_of!(sqlite3_index_info, idxStr) - 48usize];
    ["Offset of field: sqlite3_index_info::needToFreeIdxStr"]
        [::core::mem::offset_of!(sqlite3_index_info, needToFreeIdxStr) - 56usize];
    ["Offset of field: sqlite3_index_info::orderByConsumed"]
        [::core::mem::offset_of!(sqlite3_index_info, orderByConsumed) - 60usize];
    ["Offset of field: sqlite3_index_info::estimatedCost"]
        [::core::mem::offset_of!(sqlite3_index_info, estimatedCost) - 64usize];
    ["Offset of field: sqlite3_index_info::estimatedRows"]
        [::core::mem::offset_of!(sqlite3_index_info, estimatedRows) - 72usize];
    ["Offset of field: sqlite3_index_info::idxFlags"]
        [::core::mem::offset_of!(sqlite3_index_info, idxFlags) - 80usize];
    ["Offset of field: sqlite3_index_info::colUsed"]
        [::core::mem::offset_of!(sqlite3_index_info, colUsed) - 88usize];
};
unsafe extern "C" {
    pub fn sqlite3_create_module(
        db: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        p: *const sqlite3_module,
        pClientData: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_create_module_v2(
        db: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        p: *const sqlite3_module,
        pClientData: *mut ::core::ffi::c_void,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_drop_modules(
        db: *mut sqlite3,
        azKeep: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_vtab {
    pub pModule: *const sqlite3_module,
    pub nRef: ::core::ffi::c_int,
    pub zErrMsg: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_vtab"][::core::mem::size_of::<sqlite3_vtab>() - 24usize];
    ["Alignment of sqlite3_vtab"][::core::mem::align_of::<sqlite3_vtab>() - 8usize];
    ["Offset of field: sqlite3_vtab::pModule"]
        [::core::mem::offset_of!(sqlite3_vtab, pModule) - 0usize];
    ["Offset of field: sqlite3_vtab::nRef"][::core::mem::offset_of!(sqlite3_vtab, nRef) - 8usize];
    ["Offset of field: sqlite3_vtab::zErrMsg"]
        [::core::mem::offset_of!(sqlite3_vtab, zErrMsg) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_vtab_cursor {
    pub pVtab: *mut sqlite3_vtab,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_vtab_cursor"][::core::mem::size_of::<sqlite3_vtab_cursor>() - 8usize];
    ["Alignment of sqlite3_vtab_cursor"][::core::mem::align_of::<sqlite3_vtab_cursor>() - 8usize];
    ["Offset of field: sqlite3_vtab_cursor::pVtab"]
        [::core::mem::offset_of!(sqlite3_vtab_cursor, pVtab) - 0usize];
};
unsafe extern "C" {
    pub fn sqlite3_declare_vtab(
        arg1: *mut sqlite3,
        zSQL: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_overload_function(
        arg1: *mut sqlite3,
        zFuncName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_blob {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn sqlite3_blob_open(
        arg1: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
        zTable: *const ::core::ffi::c_char,
        zColumn: *const ::core::ffi::c_char,
        iRow: sqlite3_int64,
        flags: ::core::ffi::c_int,
        ppBlob: *mut *mut sqlite3_blob,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_blob_reopen(arg1: *mut sqlite3_blob, arg2: sqlite3_int64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_blob_close(arg1: *mut sqlite3_blob) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_blob_bytes(arg1: *mut sqlite3_blob) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_blob_read(
        arg1: *mut sqlite3_blob,
        Z: *mut ::core::ffi::c_void,
        N: ::core::ffi::c_int,
        iOffset: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_blob_write(
        arg1: *mut sqlite3_blob,
        z: *const ::core::ffi::c_void,
        n: ::core::ffi::c_int,
        iOffset: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_vfs_find(zVfsName: *const ::core::ffi::c_char) -> *mut sqlite3_vfs;
}
unsafe extern "C" {
    pub fn sqlite3_vfs_register(
        arg1: *mut sqlite3_vfs,
        makeDflt: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_vfs_unregister(arg1: *mut sqlite3_vfs) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_mutex_alloc(arg1: ::core::ffi::c_int) -> *mut sqlite3_mutex;
}
unsafe extern "C" {
    pub fn sqlite3_mutex_free(arg1: *mut sqlite3_mutex);
}
unsafe extern "C" {
    pub fn sqlite3_mutex_enter(arg1: *mut sqlite3_mutex);
}
unsafe extern "C" {
    pub fn sqlite3_mutex_try(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_mutex_leave(arg1: *mut sqlite3_mutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_mutex_methods {
    pub xMutexInit: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub xMutexEnd: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub xMutexAlloc: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *mut sqlite3_mutex,
    >,
    pub xMutexFree: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub xMutexEnter: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub xMutexTry: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
    pub xMutexLeave: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub xMutexHeld: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
    pub xMutexNotheld: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_mutex_methods"][::core::mem::size_of::<sqlite3_mutex_methods>() - 72usize];
    ["Alignment of sqlite3_mutex_methods"]
        [::core::mem::align_of::<sqlite3_mutex_methods>() - 8usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexInit"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexInit) - 0usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexEnd"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexEnd) - 8usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexAlloc"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexAlloc) - 16usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexFree"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexFree) - 24usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexEnter"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexEnter) - 32usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexTry"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexTry) - 40usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexLeave"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexLeave) - 48usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexHeld"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexHeld) - 56usize];
    ["Offset of field: sqlite3_mutex_methods::xMutexNotheld"]
        [::core::mem::offset_of!(sqlite3_mutex_methods, xMutexNotheld) - 64usize];
};
unsafe extern "C" {
    pub fn sqlite3_mutex_held(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_mutex_notheld(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_db_mutex(arg1: *mut sqlite3) -> *mut sqlite3_mutex;
}
unsafe extern "C" {
    pub fn sqlite3_file_control(
        arg1: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
        op: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_test_control(op: ::core::ffi::c_int, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_keyword_count() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_keyword_name(
        arg1: ::core::ffi::c_int,
        arg2: *mut *const ::core::ffi::c_char,
        arg3: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_keyword_check(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_str {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn sqlite3_str_new(arg1: *mut sqlite3) -> *mut sqlite3_str;
}
unsafe extern "C" {
    pub fn sqlite3_str_finish(arg1: *mut sqlite3_str) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_str_appendf(arg1: *mut sqlite3_str, zFormat: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn sqlite3_str_vappendf(
        arg1: *mut sqlite3_str,
        zFormat: *const ::core::ffi::c_char,
        arg2: *mut __va_list_tag,
    );
}
unsafe extern "C" {
    pub fn sqlite3_str_append(
        arg1: *mut sqlite3_str,
        zIn: *const ::core::ffi::c_char,
        N: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn sqlite3_str_appendall(arg1: *mut sqlite3_str, zIn: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn sqlite3_str_appendchar(
        arg1: *mut sqlite3_str,
        N: ::core::ffi::c_int,
        C: ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    pub fn sqlite3_str_reset(arg1: *mut sqlite3_str);
}
unsafe extern "C" {
    pub fn sqlite3_str_errcode(arg1: *mut sqlite3_str) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_str_length(arg1: *mut sqlite3_str) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_str_value(arg1: *mut sqlite3_str) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_status(
        op: ::core::ffi::c_int,
        pCurrent: *mut ::core::ffi::c_int,
        pHighwater: *mut ::core::ffi::c_int,
        resetFlag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_status64(
        op: ::core::ffi::c_int,
        pCurrent: *mut sqlite3_int64,
        pHighwater: *mut sqlite3_int64,
        resetFlag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_db_status(
        arg1: *mut sqlite3,
        op: ::core::ffi::c_int,
        pCur: *mut ::core::ffi::c_int,
        pHiwtr: *mut ::core::ffi::c_int,
        resetFlg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_stmt_status(
        arg1: *mut sqlite3_stmt,
        op: ::core::ffi::c_int,
        resetFlg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache_page {
    pub pBuf: *mut ::core::ffi::c_void,
    pub pExtra: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_pcache_page"][::core::mem::size_of::<sqlite3_pcache_page>() - 16usize];
    ["Alignment of sqlite3_pcache_page"][::core::mem::align_of::<sqlite3_pcache_page>() - 8usize];
    ["Offset of field: sqlite3_pcache_page::pBuf"]
        [::core::mem::offset_of!(sqlite3_pcache_page, pBuf) - 0usize];
    ["Offset of field: sqlite3_pcache_page::pExtra"]
        [::core::mem::offset_of!(sqlite3_pcache_page, pExtra) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache_methods2 {
    pub iVersion: ::core::ffi::c_int,
    pub pArg: *mut ::core::ffi::c_void,
    pub xInit: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xShutdown: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            szPage: ::core::ffi::c_int,
            szExtra: ::core::ffi::c_int,
            bPurgeable: ::core::ffi::c_int,
        ) -> *mut sqlite3_pcache,
    >,
    pub xCachesize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, nCachesize: ::core::ffi::c_int),
    >,
    pub xPagecount: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache) -> ::core::ffi::c_int,
    >,
    pub xFetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            key: ::core::ffi::c_uint,
            createFlag: ::core::ffi::c_int,
        ) -> *mut sqlite3_pcache_page,
    >,
    pub xUnpin: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut sqlite3_pcache_page,
            discard: ::core::ffi::c_int,
        ),
    >,
    pub xRekey: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut sqlite3_pcache_page,
            oldKey: ::core::ffi::c_uint,
            newKey: ::core::ffi::c_uint,
        ),
    >,
    pub xTruncate: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, iLimit: ::core::ffi::c_uint),
    >,
    pub xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_pcache)>,
    pub xShrink: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_pcache)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_pcache_methods2"]
        [::core::mem::size_of::<sqlite3_pcache_methods2>() - 104usize];
    ["Alignment of sqlite3_pcache_methods2"]
        [::core::mem::align_of::<sqlite3_pcache_methods2>() - 8usize];
    ["Offset of field: sqlite3_pcache_methods2::iVersion"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, iVersion) - 0usize];
    ["Offset of field: sqlite3_pcache_methods2::pArg"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, pArg) - 8usize];
    ["Offset of field: sqlite3_pcache_methods2::xInit"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xInit) - 16usize];
    ["Offset of field: sqlite3_pcache_methods2::xShutdown"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xShutdown) - 24usize];
    ["Offset of field: sqlite3_pcache_methods2::xCreate"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xCreate) - 32usize];
    ["Offset of field: sqlite3_pcache_methods2::xCachesize"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xCachesize) - 40usize];
    ["Offset of field: sqlite3_pcache_methods2::xPagecount"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xPagecount) - 48usize];
    ["Offset of field: sqlite3_pcache_methods2::xFetch"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xFetch) - 56usize];
    ["Offset of field: sqlite3_pcache_methods2::xUnpin"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xUnpin) - 64usize];
    ["Offset of field: sqlite3_pcache_methods2::xRekey"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xRekey) - 72usize];
    ["Offset of field: sqlite3_pcache_methods2::xTruncate"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xTruncate) - 80usize];
    ["Offset of field: sqlite3_pcache_methods2::xDestroy"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xDestroy) - 88usize];
    ["Offset of field: sqlite3_pcache_methods2::xShrink"]
        [::core::mem::offset_of!(sqlite3_pcache_methods2, xShrink) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache_methods {
    pub pArg: *mut ::core::ffi::c_void,
    pub xInit: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xShutdown: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            szPage: ::core::ffi::c_int,
            bPurgeable: ::core::ffi::c_int,
        ) -> *mut sqlite3_pcache,
    >,
    pub xCachesize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, nCachesize: ::core::ffi::c_int),
    >,
    pub xPagecount: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache) -> ::core::ffi::c_int,
    >,
    pub xFetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            key: ::core::ffi::c_uint,
            createFlag: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xUnpin: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut ::core::ffi::c_void,
            discard: ::core::ffi::c_int,
        ),
    >,
    pub xRekey: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut ::core::ffi::c_void,
            oldKey: ::core::ffi::c_uint,
            newKey: ::core::ffi::c_uint,
        ),
    >,
    pub xTruncate: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, iLimit: ::core::ffi::c_uint),
    >,
    pub xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_pcache)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_pcache_methods"][::core::mem::size_of::<sqlite3_pcache_methods>() - 88usize];
    ["Alignment of sqlite3_pcache_methods"]
        [::core::mem::align_of::<sqlite3_pcache_methods>() - 8usize];
    ["Offset of field: sqlite3_pcache_methods::pArg"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, pArg) - 0usize];
    ["Offset of field: sqlite3_pcache_methods::xInit"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xInit) - 8usize];
    ["Offset of field: sqlite3_pcache_methods::xShutdown"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xShutdown) - 16usize];
    ["Offset of field: sqlite3_pcache_methods::xCreate"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xCreate) - 24usize];
    ["Offset of field: sqlite3_pcache_methods::xCachesize"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xCachesize) - 32usize];
    ["Offset of field: sqlite3_pcache_methods::xPagecount"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xPagecount) - 40usize];
    ["Offset of field: sqlite3_pcache_methods::xFetch"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xFetch) - 48usize];
    ["Offset of field: sqlite3_pcache_methods::xUnpin"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xUnpin) - 56usize];
    ["Offset of field: sqlite3_pcache_methods::xRekey"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xRekey) - 64usize];
    ["Offset of field: sqlite3_pcache_methods::xTruncate"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xTruncate) - 72usize];
    ["Offset of field: sqlite3_pcache_methods::xDestroy"]
        [::core::mem::offset_of!(sqlite3_pcache_methods, xDestroy) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_backup {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn sqlite3_backup_init(
        pDest: *mut sqlite3,
        zDestName: *const ::core::ffi::c_char,
        pSource: *mut sqlite3,
        zSourceName: *const ::core::ffi::c_char,
    ) -> *mut sqlite3_backup;
}
unsafe extern "C" {
    pub fn sqlite3_backup_step(
        p: *mut sqlite3_backup,
        nPage: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_backup_finish(p: *mut sqlite3_backup) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_backup_remaining(p: *mut sqlite3_backup) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_backup_pagecount(p: *mut sqlite3_backup) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_unlock_notify(
        pBlocked: *mut sqlite3,
        xNotify: ::core::option::Option<
            unsafe extern "C" fn(apArg: *mut *mut ::core::ffi::c_void, nArg: ::core::ffi::c_int),
        >,
        pNotifyArg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_stricmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_strnicmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_strglob(
        zGlob: *const ::core::ffi::c_char,
        zStr: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_strlike(
        zGlob: *const ::core::ffi::c_char,
        zStr: *const ::core::ffi::c_char,
        cEsc: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_log(iErrCode: ::core::ffi::c_int, zFormat: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn sqlite3_wal_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut sqlite3,
                arg3: *const ::core::ffi::c_char,
                arg4: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn sqlite3_wal_autocheckpoint(
        db: *mut sqlite3,
        N: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_wal_checkpoint(
        db: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_wal_checkpoint_v2(
        db: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
        eMode: ::core::ffi::c_int,
        pnLog: *mut ::core::ffi::c_int,
        pnCkpt: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_vtab_config(
        arg1: *mut sqlite3,
        op: ::core::ffi::c_int,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_vtab_on_conflict(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_vtab_nochange(arg1: *mut sqlite3_context) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_vtab_collation(
        arg1: *mut sqlite3_index_info,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn sqlite3_stmt_scanstatus(
        pStmt: *mut sqlite3_stmt,
        idx: ::core::ffi::c_int,
        iScanStatusOp: ::core::ffi::c_int,
        pOut: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_stmt_scanstatus_reset(arg1: *mut sqlite3_stmt);
}
unsafe extern "C" {
    pub fn sqlite3_db_cacheflush(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_system_errno(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_snapshot {
    pub hidden: [::core::ffi::c_uchar; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_snapshot"][::core::mem::size_of::<sqlite3_snapshot>() - 48usize];
    ["Alignment of sqlite3_snapshot"][::core::mem::align_of::<sqlite3_snapshot>() - 1usize];
    ["Offset of field: sqlite3_snapshot::hidden"]
        [::core::mem::offset_of!(sqlite3_snapshot, hidden) - 0usize];
};
unsafe extern "C" {
    pub fn sqlite3_snapshot_get(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        ppSnapshot: *mut *mut sqlite3_snapshot,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_snapshot_open(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        pSnapshot: *mut sqlite3_snapshot,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_snapshot_free(arg1: *mut sqlite3_snapshot);
}
unsafe extern "C" {
    pub fn sqlite3_snapshot_cmp(
        p1: *mut sqlite3_snapshot,
        p2: *mut sqlite3_snapshot,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_snapshot_recover(
        db: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sqlite3_serialize(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        piSize: *mut sqlite3_int64,
        mFlags: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn sqlite3_deserialize(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        pData: *mut ::core::ffi::c_uchar,
        szDb: sqlite3_int64,
        szBuf: sqlite3_int64,
        mFlags: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
pub type sqlite3_rtree_dbl = f64;
unsafe extern "C" {
    pub fn sqlite3_rtree_geometry_callback(
        db: *mut sqlite3,
        zGeom: *const ::core::ffi::c_char,
        xGeom: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_rtree_geometry,
                arg2: ::core::ffi::c_int,
                arg3: *mut sqlite3_rtree_dbl,
                arg4: *mut ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        pContext: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_rtree_geometry {
    pub pContext: *mut ::core::ffi::c_void,
    pub nParam: ::core::ffi::c_int,
    pub aParam: *mut sqlite3_rtree_dbl,
    pub pUser: *mut ::core::ffi::c_void,
    pub xDelUser: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_rtree_geometry"][::core::mem::size_of::<sqlite3_rtree_geometry>() - 40usize];
    ["Alignment of sqlite3_rtree_geometry"]
        [::core::mem::align_of::<sqlite3_rtree_geometry>() - 8usize];
    ["Offset of field: sqlite3_rtree_geometry::pContext"]
        [::core::mem::offset_of!(sqlite3_rtree_geometry, pContext) - 0usize];
    ["Offset of field: sqlite3_rtree_geometry::nParam"]
        [::core::mem::offset_of!(sqlite3_rtree_geometry, nParam) - 8usize];
    ["Offset of field: sqlite3_rtree_geometry::aParam"]
        [::core::mem::offset_of!(sqlite3_rtree_geometry, aParam) - 16usize];
    ["Offset of field: sqlite3_rtree_geometry::pUser"]
        [::core::mem::offset_of!(sqlite3_rtree_geometry, pUser) - 24usize];
    ["Offset of field: sqlite3_rtree_geometry::xDelUser"]
        [::core::mem::offset_of!(sqlite3_rtree_geometry, xDelUser) - 32usize];
};
unsafe extern "C" {
    pub fn sqlite3_rtree_query_callback(
        db: *mut sqlite3,
        zQueryFunc: *const ::core::ffi::c_char,
        xQueryFunc: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut sqlite3_rtree_query_info) -> ::core::ffi::c_int,
        >,
        pContext: *mut ::core::ffi::c_void,
        xDestructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_rtree_query_info {
    pub pContext: *mut ::core::ffi::c_void,
    pub nParam: ::core::ffi::c_int,
    pub aParam: *mut sqlite3_rtree_dbl,
    pub pUser: *mut ::core::ffi::c_void,
    pub xDelUser: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub aCoord: *mut sqlite3_rtree_dbl,
    pub anQueue: *mut ::core::ffi::c_uint,
    pub nCoord: ::core::ffi::c_int,
    pub iLevel: ::core::ffi::c_int,
    pub mxLevel: ::core::ffi::c_int,
    pub iRowid: sqlite3_int64,
    pub rParentScore: sqlite3_rtree_dbl,
    pub eParentWithin: ::core::ffi::c_int,
    pub eWithin: ::core::ffi::c_int,
    pub rScore: sqlite3_rtree_dbl,
    pub apSqlParam: *mut *mut sqlite3_value,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sqlite3_rtree_query_info"]
        [::core::mem::size_of::<sqlite3_rtree_query_info>() - 112usize];
    ["Alignment of sqlite3_rtree_query_info"]
        [::core::mem::align_of::<sqlite3_rtree_query_info>() - 8usize];
    ["Offset of field: sqlite3_rtree_query_info::pContext"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, pContext) - 0usize];
    ["Offset of field: sqlite3_rtree_query_info::nParam"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, nParam) - 8usize];
    ["Offset of field: sqlite3_rtree_query_info::aParam"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, aParam) - 16usize];
    ["Offset of field: sqlite3_rtree_query_info::pUser"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, pUser) - 24usize];
    ["Offset of field: sqlite3_rtree_query_info::xDelUser"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, xDelUser) - 32usize];
    ["Offset of field: sqlite3_rtree_query_info::aCoord"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, aCoord) - 40usize];
    ["Offset of field: sqlite3_rtree_query_info::anQueue"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, anQueue) - 48usize];
    ["Offset of field: sqlite3_rtree_query_info::nCoord"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, nCoord) - 56usize];
    ["Offset of field: sqlite3_rtree_query_info::iLevel"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, iLevel) - 60usize];
    ["Offset of field: sqlite3_rtree_query_info::mxLevel"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, mxLevel) - 64usize];
    ["Offset of field: sqlite3_rtree_query_info::iRowid"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, iRowid) - 72usize];
    ["Offset of field: sqlite3_rtree_query_info::rParentScore"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, rParentScore) - 80usize];
    ["Offset of field: sqlite3_rtree_query_info::eParentWithin"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, eParentWithin) - 88usize];
    ["Offset of field: sqlite3_rtree_query_info::eWithin"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, eWithin) - 92usize];
    ["Offset of field: sqlite3_rtree_query_info::rScore"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, rScore) - 96usize];
    ["Offset of field: sqlite3_rtree_query_info::apSqlParam"]
        [::core::mem::offset_of!(sqlite3_rtree_query_info, apSqlParam) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5Context {
    _unused: [u8; 0],
}
pub type fts5_extension_function = ::core::option::Option<
    unsafe extern "C" fn(
        pApi: *const Fts5ExtensionApi,
        pFts: *mut Fts5Context,
        pCtx: *mut sqlite3_context,
        nVal: ::core::ffi::c_int,
        apVal: *mut *mut sqlite3_value,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5PhraseIter {
    pub a: *const ::core::ffi::c_uchar,
    pub b: *const ::core::ffi::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Fts5PhraseIter"][::core::mem::size_of::<Fts5PhraseIter>() - 16usize];
    ["Alignment of Fts5PhraseIter"][::core::mem::align_of::<Fts5PhraseIter>() - 8usize];
    ["Offset of field: Fts5PhraseIter::a"][::core::mem::offset_of!(Fts5PhraseIter, a) - 0usize];
    ["Offset of field: Fts5PhraseIter::b"][::core::mem::offset_of!(Fts5PhraseIter, b) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5ExtensionApi {
    pub iVersion: ::core::ffi::c_int,
    pub xUserData: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut Fts5Context) -> *mut ::core::ffi::c_void,
    >,
    pub xColumnCount:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Context) -> ::core::ffi::c_int>,
    pub xRowCount: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pnRow: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xColumnTotalSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iCol: ::core::ffi::c_int,
            pnToken: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xTokenize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pText: *const ::core::ffi::c_char,
            nText: ::core::ffi::c_int,
            pCtx: *mut ::core::ffi::c_void,
            xToken: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_char,
                    arg4: ::core::ffi::c_int,
                    arg5: ::core::ffi::c_int,
                    arg6: ::core::ffi::c_int,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub xPhraseCount:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Context) -> ::core::ffi::c_int>,
    pub xPhraseSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xInstCount: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pnInst: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xInst: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iIdx: ::core::ffi::c_int,
            piPhrase: *mut ::core::ffi::c_int,
            piCol: *mut ::core::ffi::c_int,
            piOff: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRowid:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Context) -> sqlite3_int64>,
    pub xColumnText: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iCol: ::core::ffi::c_int,
            pz: *mut *const ::core::ffi::c_char,
            pn: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xColumnSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iCol: ::core::ffi::c_int,
            pnToken: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xQueryPhrase: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            pUserData: *mut ::core::ffi::c_void,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *const Fts5ExtensionApi,
                    arg2: *mut Fts5Context,
                    arg3: *mut ::core::ffi::c_void,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub xSetAuxdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pAux: *mut ::core::ffi::c_void,
            xDelete: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub xGetAuxdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            bClear: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xPhraseFirst: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            arg2: *mut Fts5PhraseIter,
            arg3: *mut ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xPhraseNext: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            arg2: *mut Fts5PhraseIter,
            piCol: *mut ::core::ffi::c_int,
            piOff: *mut ::core::ffi::c_int,
        ),
    >,
    pub xPhraseFirstColumn: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            arg2: *mut Fts5PhraseIter,
            arg3: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xPhraseNextColumn: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            arg2: *mut Fts5PhraseIter,
            piCol: *mut ::core::ffi::c_int,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Fts5ExtensionApi"][::core::mem::size_of::<Fts5ExtensionApi>() - 160usize];
    ["Alignment of Fts5ExtensionApi"][::core::mem::align_of::<Fts5ExtensionApi>() - 8usize];
    ["Offset of field: Fts5ExtensionApi::iVersion"]
        [::core::mem::offset_of!(Fts5ExtensionApi, iVersion) - 0usize];
    ["Offset of field: Fts5ExtensionApi::xUserData"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xUserData) - 8usize];
    ["Offset of field: Fts5ExtensionApi::xColumnCount"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xColumnCount) - 16usize];
    ["Offset of field: Fts5ExtensionApi::xRowCount"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xRowCount) - 24usize];
    ["Offset of field: Fts5ExtensionApi::xColumnTotalSize"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xColumnTotalSize) - 32usize];
    ["Offset of field: Fts5ExtensionApi::xTokenize"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xTokenize) - 40usize];
    ["Offset of field: Fts5ExtensionApi::xPhraseCount"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xPhraseCount) - 48usize];
    ["Offset of field: Fts5ExtensionApi::xPhraseSize"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xPhraseSize) - 56usize];
    ["Offset of field: Fts5ExtensionApi::xInstCount"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xInstCount) - 64usize];
    ["Offset of field: Fts5ExtensionApi::xInst"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xInst) - 72usize];
    ["Offset of field: Fts5ExtensionApi::xRowid"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xRowid) - 80usize];
    ["Offset of field: Fts5ExtensionApi::xColumnText"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xColumnText) - 88usize];
    ["Offset of field: Fts5ExtensionApi::xColumnSize"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xColumnSize) - 96usize];
    ["Offset of field: Fts5ExtensionApi::xQueryPhrase"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xQueryPhrase) - 104usize];
    ["Offset of field: Fts5ExtensionApi::xSetAuxdata"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xSetAuxdata) - 112usize];
    ["Offset of field: Fts5ExtensionApi::xGetAuxdata"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xGetAuxdata) - 120usize];
    ["Offset of field: Fts5ExtensionApi::xPhraseFirst"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xPhraseFirst) - 128usize];
    ["Offset of field: Fts5ExtensionApi::xPhraseNext"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xPhraseNext) - 136usize];
    ["Offset of field: Fts5ExtensionApi::xPhraseFirstColumn"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xPhraseFirstColumn) - 144usize];
    ["Offset of field: Fts5ExtensionApi::xPhraseNextColumn"]
        [::core::mem::offset_of!(Fts5ExtensionApi, xPhraseNextColumn) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5Tokenizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fts5_tokenizer {
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            azArg: *mut *const ::core::ffi::c_char,
            nArg: ::core::ffi::c_int,
            ppOut: *mut *mut Fts5Tokenizer,
        ) -> ::core::ffi::c_int,
    >,
    pub xDelete: ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Tokenizer)>,
    pub xTokenize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Tokenizer,
            pCtx: *mut ::core::ffi::c_void,
            flags: ::core::ffi::c_int,
            pText: *const ::core::ffi::c_char,
            nText: ::core::ffi::c_int,
            xToken: ::core::option::Option<
                unsafe extern "C" fn(
                    pCtx: *mut ::core::ffi::c_void,
                    tflags: ::core::ffi::c_int,
                    pToken: *const ::core::ffi::c_char,
                    nToken: ::core::ffi::c_int,
                    iStart: ::core::ffi::c_int,
                    iEnd: ::core::ffi::c_int,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fts5_tokenizer"][::core::mem::size_of::<fts5_tokenizer>() - 24usize];
    ["Alignment of fts5_tokenizer"][::core::mem::align_of::<fts5_tokenizer>() - 8usize];
    ["Offset of field: fts5_tokenizer::xCreate"]
        [::core::mem::offset_of!(fts5_tokenizer, xCreate) - 0usize];
    ["Offset of field: fts5_tokenizer::xDelete"]
        [::core::mem::offset_of!(fts5_tokenizer, xDelete) - 8usize];
    ["Offset of field: fts5_tokenizer::xTokenize"]
        [::core::mem::offset_of!(fts5_tokenizer, xTokenize) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fts5_api {
    pub iVersion: ::core::ffi::c_int,
    pub xCreateTokenizer: ::core::option::Option<
        unsafe extern "C" fn(
            pApi: *mut fts5_api,
            zName: *const ::core::ffi::c_char,
            pContext: *mut ::core::ffi::c_void,
            pTokenizer: *mut fts5_tokenizer,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub xFindTokenizer: ::core::option::Option<
        unsafe extern "C" fn(
            pApi: *mut fts5_api,
            zName: *const ::core::ffi::c_char,
            ppContext: *mut *mut ::core::ffi::c_void,
            pTokenizer: *mut fts5_tokenizer,
        ) -> ::core::ffi::c_int,
    >,
    pub xCreateFunction: ::core::option::Option<
        unsafe extern "C" fn(
            pApi: *mut fts5_api,
            zName: *const ::core::ffi::c_char,
            pContext: *mut ::core::ffi::c_void,
            xFunction: fts5_extension_function,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fts5_api"][::core::mem::size_of::<fts5_api>() - 32usize];
    ["Alignment of fts5_api"][::core::mem::align_of::<fts5_api>() - 8usize];
    ["Offset of field: fts5_api::iVersion"][::core::mem::offset_of!(fts5_api, iVersion) - 0usize];
    ["Offset of field: fts5_api::xCreateTokenizer"]
        [::core::mem::offset_of!(fts5_api, xCreateTokenizer) - 8usize];
    ["Offset of field: fts5_api::xFindTokenizer"]
        [::core::mem::offset_of!(fts5_api, xFindTokenizer) - 16usize];
    ["Offset of field: fts5_api::xCreateFunction"]
        [::core::mem::offset_of!(fts5_api, xCreateFunction) - 24usize];
};
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::core::ffi::c_uint,
    pub fp_offset: ::core::ffi::c_uint,
    pub overflow_arg_area: *mut ::core::ffi::c_void,
    pub reg_save_area: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::core::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::core::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::core::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::core::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::core::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::core::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
